<!DOCTYPE html>
<html>
<head>
	<meta charset="utf-8" />
	<meta http-equiv="X-UA-Compatible" content="IE=edge"><title>When and how to implement Sharding in Neo4j 4.0 - Adam Cowley | Full Stack Developer specialising in Neo4j and Node JS</title><meta name="viewport" content="width=device-width, initial-scale=1">
	<meta property="og:title" content="When and how to implement Sharding in Neo4j 4.0" />
<meta property="og:description" content="When you are dealing with large volumes of data, you may need to shard your graph across many physical servers.  Here&#39;s how&amp;hellip;" />
<meta property="og:type" content="article" />
<meta property="og:url" content="http://www.adamcowley.co.uk/neo4j/sharding-neo4j-4.0/" />
<meta property="article:published_time" content="2020-01-15T08:30:00+00:00" />
<meta property="article:modified_time" content="2020-01-15T08:30:00+00:00" />
<meta name="twitter:card" content="summary"/>
<meta name="twitter:title" content="When and how to implement Sharding in Neo4j 4.0"/>
<meta name="twitter:description" content="When you are dealing with large volumes of data, you may need to shard your graph across many physical servers.  Here&#39;s how&amp;hellip;"/>


	
	<link rel="stylesheet" type="text/css" media="all" href="/css/adamcowley.css" />

	
	
</head>

<body>
		<header class="header clear" role="banner" id="header">
		<div class="container">
			<h1 class="logo">
				<a href="/">
					<img src="/img/ac-green.svg" alt="Adam Cowley | Full Stack Developer specialising in Neo4j and Node JS">
				</a>
			</h1>
			
			<nav class="nav" role="navigation">
				<ul>
					
					<li>
						<a href="/categories/javascript/">javascript</a>
					</li>
					
					<li>
						<a href="/categories/neo4j/">neo4j</a>
					</li>
					<li>
        <a href="http://twitter.com/adamcowley" target="_blank">
            <svg style="height:24px;width:24px" version="1.1" id="Icons" xmlns="http://www.w3.org/2000/svg" xmlns:xlink="http://www.w3.org/1999/xlink" x="0px" y="0px" width="100px" height="100px" viewBox="0 0 100 100" xml:space="preserve"> <path id="Twitter__x28_alt_x29_" d="M84.803,46.564c5.055-0.417,8.483-2.715,9.803-5.833c-1.824,1.12-7.484,2.341-10.61,1.178 	c-0.153-0.734-0.324-1.432-0.492-2.062c-2.382-8.746-10.537-15.792-19.082-14.941c0.691-0.279,1.392-0.539,2.092-0.772 	c0.94-0.337,6.459-1.235,5.59-3.183c-0.733-1.713-7.475,1.295-8.744,1.688c1.675-0.63,4.447-1.714,4.743-3.64 	c-2.567,0.352-5.087,1.566-7.034,3.331c0.703-0.757,1.236-1.679,1.349-2.672C55.57,24.033,51.57,32.853,48.333,41.408 	c-2.542-2.463-4.795-4.403-6.816-5.48c-5.67-3.041-12.449-6.213-23.091-10.164c-0.327,3.521,1.741,8.203,7.7,11.316 	c-1.291-0.173-3.652,0.213-5.54,0.665c0.769,4.034,3.28,7.357,10.079,8.964c-3.107,0.205-4.713,0.912-6.168,2.436 	c1.415,2.805,4.868,6.107,11.08,5.429c-6.906,2.977-2.816,8.49,2.804,7.667C28.794,72.143,13.679,71.416,5,63.134 	c22.661,30.879,71.921,18.262,79.262-11.481c5.499,0.047,8.733-1.905,10.738-4.057C91.831,48.134,87.239,47.578,84.803,46.564z"></path> </svg>
        </a>
    </li>
    <li>
        <a href="https://www.linkedin.com/in/adamcowley/" target="_blank">
            <svg version="1.1" id="Icons" xmlns="http://www.w3.org/2000/svg" xmlns:xlink="http://www.w3.org/1999/xlink" x="0px" y="0px"
width="100px" height="100px" viewBox="0 0 100 100" xml:space="preserve" style="enable-background:new 0 0 100 100; width: 18px;height: 26px;">
<path id="LinkedIn__x28_alt_x29_" d="M87.877,5.608H11.174c-3.673,0-6.65,2.886-6.65,6.448v77.101c0,3.562,2.978,6.451,6.65,6.451
h76.703c3.673,0,6.646-2.89,6.646-6.451V12.056C94.523,8.495,91.55,5.608,87.877,5.608z M31.809,80.944H18.211V40.31h13.598V80.944z
M25.011,34.759H24.92c-4.56,0-7.516-3.119-7.516-7.023c0-3.983,3.043-7.017,7.693-7.017c4.651,0,7.512,3.033,7.602,7.017
C32.699,31.641,29.749,34.759,25.011,34.759z M80.827,80.944H67.233v-21.74c0-5.464-1.97-9.191-6.886-9.191
c-3.761,0-5.993,2.515-6.973,4.942c-0.364,0.868-0.453,2.08-0.453,3.292v22.696H39.329c0,0,0.178-36.823,0-40.634h13.593v5.761
c1.805-2.768,5.029-6.717,12.249-6.717c8.947,0,15.656,5.804,15.656,18.291V80.944z M52.834,46.199
c0.024-0.038,0.056-0.084,0.088-0.128v0.128H52.834z" />
</svg>
        </a>
    </li>
    <li>
        <a href="https://github.com/adam-cowley" target="_blank">
            <svg width="20px" height="25px" viewBox="0 0 256 250" version="1.1" xmlns="http://www.w3.org/2000/svg" xmlns:xlink="http://www.w3.org/1999/xlink" preserveAspectRatio="xMidYMid">
                <g>
                    <path d="M128.00106,0 C57.3172926,0 0,57.3066942 0,128.00106 C0,184.555281 36.6761997,232.535542 87.534937,249.460899 C93.9320223,250.645779 96.280588,246.684165 96.280588,243.303333 C96.280588,240.251045 96.1618878,230.167899 96.106777,219.472176 C60.4967585,227.215235 52.9826207,204.369712 52.9826207,204.369712 C47.1599584,189.574598 38.770408,185.640538 38.770408,185.640538 C27.1568785,177.696113 39.6458206,177.859325 39.6458206,177.859325 C52.4993419,178.762293 59.267365,191.04987 59.267365,191.04987 C70.6837675,210.618423 89.2115753,204.961093 96.5158685,201.690482 C97.6647155,193.417512 100.981959,187.77078 104.642583,184.574357 C76.211799,181.33766 46.324819,170.362144 46.324819,121.315702 C46.324819,107.340889 51.3250588,95.9223682 59.5132437,86.9583937 C58.1842268,83.7344152 53.8029229,70.715562 60.7532354,53.0843636 C60.7532354,53.0843636 71.5019501,49.6441813 95.9626412,66.2049595 C106.172967,63.368876 117.123047,61.9465949 128.00106,61.8978432 C138.879073,61.9465949 149.837632,63.368876 160.067033,66.2049595 C184.49805,49.6441813 195.231926,53.0843636 195.231926,53.0843636 C202.199197,70.715562 197.815773,83.7344152 196.486756,86.9583937 C204.694018,95.9223682 209.660343,107.340889 209.660343,121.315702 C209.660343,170.478725 179.716133,181.303747 151.213281,184.472614 C155.80443,188.444828 159.895342,196.234518 159.895342,208.176593 C159.895342,225.303317 159.746968,239.087361 159.746968,243.303333 C159.746968,246.709601 162.05102,250.70089 168.53925,249.443941 C219.370432,232.499507 256,184.536204 256,128.00106 C256,57.3066942 198.691187,0 128.00106,0 Z M47.9405593,182.340212 C47.6586465,182.976105 46.6581745,183.166873 45.7467277,182.730227 C44.8183235,182.312656 44.2968914,181.445722 44.5978808,180.80771 C44.8734344,180.152739 45.876026,179.97045 46.8023103,180.409216 C47.7328342,180.826786 48.2627451,181.702199 47.9405593,182.340212 Z M54.2367892,187.958254 C53.6263318,188.524199 52.4329723,188.261363 51.6232682,187.366874 C50.7860088,186.474504 50.6291553,185.281144 51.2480912,184.70672 C51.8776254,184.140775 53.0349512,184.405731 53.8743302,185.298101 C54.7115892,186.201069 54.8748019,187.38595 54.2367892,187.958254 Z M58.5562413,195.146347 C57.7719732,195.691096 56.4895886,195.180261 55.6968417,194.042013 C54.9125733,192.903764 54.9125733,191.538713 55.713799,190.991845 C56.5086651,190.444977 57.7719732,190.936735 58.5753181,192.066505 C59.3574669,193.22383 59.3574669,194.58888 58.5562413,195.146347 Z M65.8613592,203.471174 C65.1597571,204.244846 63.6654083,204.03712 62.5716717,202.981538 C61.4524999,201.94927 61.1409122,200.484596 61.8446341,199.710926 C62.5547146,198.935137 64.0575422,199.15346 65.1597571,200.200564 C66.2704506,201.230712 66.6095936,202.705984 65.8613592,203.471174 Z M75.3025151,206.281542 C74.9930474,207.284134 73.553809,207.739857 72.1039724,207.313809 C70.6562556,206.875043 69.7087748,205.700761 70.0012857,204.687571 C70.302275,203.678621 71.7478721,203.20382 73.2083069,203.659543 C74.6539041,204.09619 75.6035048,205.261994 75.3025151,206.281542 Z M86.046947,207.473627 C86.0829806,208.529209 84.8535871,209.404622 83.3316829,209.4237 C81.8013,209.457614 80.563428,208.603398 80.5464708,207.564772 C80.5464708,206.498591 81.7483088,205.631657 83.2786917,205.606221 C84.8005962,205.576546 86.046947,206.424403 86.046947,207.473627 Z M96.6021471,207.069023 C96.7844366,208.099171 95.7267341,209.156872 94.215428,209.438785 C92.7295577,209.710099 91.3539086,209.074206 91.1652603,208.052538 C90.9808515,206.996955 92.0576306,205.939253 93.5413813,205.66582 C95.054807,205.402984 96.4092596,206.021919 96.6021471,207.069023 Z" fill="#0B4F71"></path>
                </g>
            </svg>        </a>
    </li>
				</ul>
			</nav>
		</div>
	</header>

	<div class="main">

		<main role="main">

		<section>





	<div class="introduction">
		<div class="container">

			<h1>When and how to implement Sharding in Neo4j 4.0</h1>
		</div>
	</div>

	<div class="container content single">
		<section>
			<article class="post">
				<p class="date">
					<time datetime="2020-01-15 08:30">
						15/01/2020 08:30
					</time>
				</p>

				<p>When you are dealing with large volumes of data, you may need to <em>shard</em> your graph across many physical servers.  A quick google search will tell you that:</p>
<blockquote>
<p>Sharding is a type of database partitioning that separates very large databases the into smaller, faster, more easily managed parts called data shards. The word shard means a small part of a whole.</p>
</blockquote>
<p>In essence, if your data is too large to fit on a single server (and with hardware capabilities and costs, we&rsquo;re talking terrabytes worth), you should consider sharding.  So, with that in mind, let&rsquo;s take a fictional example, <strong>SkyShard™</strong>.</p>
<p><strong>SkyShard™</strong> are a travel website that offer cheap flights to it&rsquo;s customers.  Due to the amount of flights the website offers,the frequency of updates, and the sheer number of combinations it makes sense to shard the data to ease the load of data and naturally narrow down the search space for possible flights.</p>
<p>If you are interested in <em>how</em> the queries work, <a href="https://maxdemarzi.com/?s=flights">Max De Marzi has some great blog posts</a>.  For now, I will concentrate on the separation of data and not how the data will be queried.</p>
<h2 id="a-brief-introduction-to-sharding-in-neo4j">A brief introduction to sharding in Neo4j</h2>
<p>Neo4j 4.0 has a huge update, named <strong>Fabric</strong>.  According to the <a href="https://neo4j.com/docs/operations-manual/4.0-preview/fabric/introduction/">Neo4j Operations Manual</a>, Fabric is defined as:</p>
<blockquote>
<p>[&hellip;] a converged platform that supports the storage, processing, analysis and management of data distributed and stored in multiple Neo4j databases.</p>
</blockquote>
<p>Simple, right?  In essence, Fabric comes with it&rsquo;s own database that acts as an entry point to the Neo4j environment.  A driver will connect to a <em>proxy</em> server or cluster of proxy servers with a set of configuration on it to give it a picture of each shard.  There is then a new <a href="https://neo4j.com/docs/operations-manual/4.0-preview/fabric/queries/">Cypher <code>USE</code> keyword</a> introduced in 4.0 that will allow you to query across shards.</p>
<p><img src="https://neo4j.com/docs/operations-manual/4.0-preview/images/fabric-single-instance.png" alt="Neo4j Fabric Setup" title="A single instance setup of Neo4j Fabric proxy server sitting between the User and 3 Neo4j Databases"></p>
<h2 id="something-to-consider">Something to consider</h2>
<p>Although you can <em>query</em> across shards, you cannot traverse across shards.  By that, I mean that you can&rsquo;t have a relationship going from a node on one shard to another.  So in this scenario, there will need to be a degree of duplication.  In this scenario, <a href="https://www.forbes.com/sites/ericrosen/2019/01/02/the-2019-list-of-the-longest-flights-in-the-world/">some long haul flights with connections may arrive in their destinations over 24 hours after original departure</a> and depending on the business requirements a 24-48 hour stopover may procude a better price.  Depending on how the data is sharded, that 24-48 hours may need to be taken into account.</p>
<p>After lengthy, hypothetical discussions, the <strong>SkyShard™</strong> team have decicded to shard by month.  So, the January shard will also need to have the first two days of February.  Then, when a request comes in, we&rsquo;ll need to decide which of the shards to query.</p>
<h2 id="configuration">Configuration</h2>
<p>Configuring fabric is surprisingly easy.  As I mentioned, one server needs to be configured as a proxy and then each shard (albeit single instances or clusters) are setup as if they were standalone neo4j instances/clusters.</p>
<h3 id="configuring-the-proxy-server">Configuring the Proxy Server</h3>
<p>Let&rsquo;s call this server <code>proxy</code> from now on.  Think of this server as a stateless server that just passes queries on to the real databases.  The proxy server must have a separate database configured for fabric that is separate from the default neo4j database, this is configured in <code>neo4j.conf</code> under <code>fabric.database.name</code>.  Let&rsquo;s call it fabric for now.</p>
<div class="file">neo4j.conf</div>
<pre><code class="language-conf" data-lang="conf">fabric.database.name=fabric
</code></pre><p>Then, the server must be aware of each shard.  As SkyShard want to be able to offer bookings three months in advance I will create 3 shards for January, February and March 2020.  The shards are configured as a 0 based array under <code>fabric.graph</code>.  There are <a href="https://neo4j.com/docs/operations-manual/4.0-preview/fabric/configuration/#_graph_settings">four configuration options</a> for each graph - a name, the bolt uri, <a href="../multi-tenancy-neo4j-4.0">database name</a> on the instance and driver configuration.</p>
<p>To save any unnecessary configuration on the shards, I&rsquo;ll go for the default neo4j database and omit the <code>fabric.graph.&lt;id&gt;.database</code> configuration option.  Each of the servers will be configured via DNS to an entry reflecting the month.</p>
<div class="file">neo4j.conf</div>
<pre><code class="language-conf" data-lang="conf"># January's shard
fabric.graph.0.name=january2020
fabric.graph.0.uri=neo4j://january:7687

# February's shard
fabric.graph.1.name=february2020
fabric.graph.1.uri=neo4j://february:7687

# March's shard
fabric.graph.2.name=march2020
fabric.graph.2.uri=neo4j://march:7687
</code></pre><h3 id="configuring-the-shards">Configuring the Shards</h3>
<p>For each of the shards, these can be set up as a single instance or as a cluster.  As far as they&rsquo;re concerned there is no need to configure anything on their side to get them to work with the proxy.</p>
<h3 id="advertised-addresses">Advertised Addresses</h3>
<p>One thing that did catch me out when I was configuring the cluster is that I hadn&rsquo;t set the <code>dbms.connector.bolt.advertised_address</code> on the shards.  Make sure you do this, otherwise when the proxy connects to each shard, the shard will advertise the address of the shard as localhost - this will cause the proxy to send the queries to itself rather than the shard.</p>
<div class="file">january: neo4j.conf</div>
<pre><code class="language-conf" data-lang="conf">dbms.connector.bolt.advertised_address=january:7687
</code></pre><p>There&rsquo;s 20 minutes of your life back.</p>
<h3 id="schemas">Schemas</h3>
<p>Another thing to consider is that as the shards are considered to be independent - any schema queries will need to be run on them directly.  Why?  Well, because shards could have the same schema on them - but maybe SkyShard also have a shard which contains customer data, maybe additional airport data.  There is no concept of auto-partitioning, those decisions are to be made yourself.</p>
<p>You could easily build some sort of script to automate this if necessary:</p>
<div class="file">cypher/constraints.cypher</div>
```cypher
CREATE CONSTRAINT ON (a:Airport) ASSERT a.code IS UNIQUE;
CREATE CONSTRAINT ON (f:Flight) ASSERT f.id IS UNIQUE;
```
<div class="highlight"><pre style="color:#f8f8f2;background-color:#272822;-moz-tab-size:4;-o-tab-size:4;tab-size:4"><code class="language-sh" data-lang="sh">$ cypher-shell -h bolt://january:2020 -u neo4j -p neo &lt; cypher/constraints.cypher
</code></pre></div><p>The same is true if you are using anything other than the default <code>neo4j</code> database in <code>fabric.graph.&lt;id&gt;.database</code> - you&rsquo;ll have to run a cypher statement to create this explicitly.</p>
<p>That&rsquo;s it.  There&rsquo;s no concept of dependencies here, if a shard is unavailable then the error will be reported at query time.  But there is no waiting for a cluster size to form before the server starts like with a causal cluster.</p>
<h2 id="querying-the-shards">Querying the Shards</h2>
<p>It is possible to query the shards directly using a bolt connection to the relevant hostname.  But you can also query the shards through the proxy.  This allows you to query across shards.</p>
<p>With version 4.0, a <code>USE</code> keyword has been added to cypher.  When you are querying through the proxy, this will allow you to select the shard to query, either via the id (think <code>fabric.graphs.&lt;id&gt;</code>) or the name  (<code>fabric.graphs.&lt;id&gt;.name</code>).</p>
<h3 id="querying-a-named-shared">Querying a Named Shared</h3>
<p>To query a single named shard, you use the <code>USE {fabricdb}.{name}</code> syntax, where <code>fabricdb</code> is the configuration value set in <code>fabric.database.name</code>.  For example, to query the shard containing January&rsquo;s data, you can run:</p>
<pre><code class="language-cypher" data-lang="cypher">USE fabric.january2020
MATCH (n) RETURN count(n)
</code></pre><p>This will proxy the query through to <code>neo4j://january:7687</code> and return the results based on the data in january2020&rsquo;s database.  If you know the ID of the shard that you&rsquo;d like to query, you can use the <code>USE {fabricdb}.graph({name})</code> syntax.</p>
<pre><code class="language-cypher" data-lang="cypher">USE fabric.graph(0)
MATCH (n) RETURN count(n)
</code></pre><h3 id="querying-across-shards">Querying Across Shards</h3>
<p>You can also query across shards using an <em>anonymous procedure call</em>.  For example, if we have flight information in one shard and then more detailed information about the airports in another, we can query across them by calling <code>CALL { /* cypher */ }</code>.</p>
<pre><code class="language-cypher" data-lang="cypher">CALL {
  // Query January 20202 for a flight
  USE fabric.january2020
  MATCH 
    (flight:Flight {id: &quot;2013-1-1--1545&quot;})-[:ORIGIN]-&gt;(o:Airport), 
    (flight)-[:DESTINATION]-&gt;(d:Airport) 
  RETURN flight, o, d
} 

// You cannot access a node inside another call, so take the property values
// that we'll need to look up 
WITH flight, o.code AS originCode, d.code AS destinationCode

CALL {
  // Take variables from previous 
  WITH originCode, destinationCode  

  // Find the nodes in the airports shard
  USE fabric.airports
  MATCH (origin:Airport {code: originCode})
  MATCH (destination:Airport {code: destinationCode})
  RETURN origin, destination
}


RETURN flight, origin, destination
</code></pre><p><img src="/uploads/sharding-neo4j-4.0/cross-shard-result.png" alt="Cross-Shard Querying" title="A neo4j result window with the properties of flight, origin and destination nodes"></p>
<p>Node values cannot be passed across shards, so the line:</p>
<p><code>WITH flight, o.code AS originCode, d.code AS destinationCode</code></p>
<p>extracts the actual property values that we&rsquo;ll need to look up the more detailed airport nodes in that shard.</p>
<h2 id="loading-the-data-via-the-proxy">Loading the Data via the Proxy</h2>
<p>Now that the proxy and shards are configured, and we know how to query across it&rsquo;s time to add some data to the shard.  Because javascript is my language of choice, I&rsquo;ll put together some code that will take a CSV file, and separate the rows out into their shards.  Beyond that the same rules around importing data apply, so I will send the updates to neo4j in batches.</p>
<div class="highlight"><pre style="color:#f8f8f2;background-color:#272822;-moz-tab-size:4;-o-tab-size:4;tab-size:4"><code class="language-js" data-lang="js"><span style="color:#66d9ef">const</span> <span style="color:#a6e22e">csv</span> <span style="color:#f92672">=</span> <span style="color:#a6e22e">require</span>(<span style="color:#e6db74">&#39;csv-parser&#39;</span>)
<span style="color:#66d9ef">const</span> <span style="color:#a6e22e">fs</span> <span style="color:#f92672">=</span> <span style="color:#a6e22e">require</span>(<span style="color:#e6db74">&#39;fs&#39;</span>)
<span style="color:#66d9ef">const</span> <span style="color:#a6e22e">neo4j</span> <span style="color:#f92672">=</span> <span style="color:#a6e22e">require</span>(<span style="color:#e6db74">&#39;neo4j-driver&#39;</span>)
<span style="color:#66d9ef">const</span> <span style="color:#a6e22e">driver</span> <span style="color:#f92672">=</span> <span style="color:#66d9ef">new</span> <span style="color:#a6e22e">neo4j</span>.<span style="color:#a6e22e">driver</span>(<span style="color:#e6db74">&#39;neo4j://localhost:7687&#39;</span>, <span style="color:#a6e22e">neo4j</span>.<span style="color:#a6e22e">auth</span>.<span style="color:#a6e22e">basic</span>(<span style="color:#e6db74">&#39;neo4j&#39;</span>, <span style="color:#e6db74">&#39;neo&#39;</span>))

<span style="color:#75715e">// Functions here ...
</span><span style="color:#75715e"></span>
<span style="color:#66d9ef">const</span> <span style="color:#a6e22e">run</span> <span style="color:#f92672">=</span> <span style="color:#a6e22e">async</span> () =&gt; {
    <span style="color:#75715e">// Create Driver instance
</span><span style="color:#75715e"></span>    <span style="color:#66d9ef">const</span> <span style="color:#a6e22e">driver</span> <span style="color:#f92672">=</span> <span style="color:#66d9ef">new</span> <span style="color:#a6e22e">neo4j</span>.<span style="color:#a6e22e">driver</span>(<span style="color:#e6db74">&#39;neo4j://localhost:7687&#39;</span>, <span style="color:#a6e22e">neo4j</span>.<span style="color:#a6e22e">auth</span>.<span style="color:#a6e22e">basic</span>(<span style="color:#e6db74">&#39;neo4j&#39;</span>, <span style="color:#e6db74">&#39;neo&#39;</span>))

    <span style="color:#75715e">// Organise rows from CSV into shard
</span><span style="color:#75715e"></span>    <span style="color:#66d9ef">const</span> <span style="color:#a6e22e">results</span> <span style="color:#f92672">=</span> <span style="color:#a6e22e">await</span> <span style="color:#a6e22e">readFromCsv</span>(<span style="color:#a6e22e">__dirname</span> <span style="color:#f92672">+</span> <span style="color:#e6db74">&#39;/data/flights.csv&#39;</span>)

    <span style="color:#75715e">// Send data to each shard
</span><span style="color:#75715e"></span>    <span style="color:#a6e22e">await</span> Promise.<span style="color:#a6e22e">all</span>(
        Object.<span style="color:#a6e22e">entries</span>(<span style="color:#a6e22e">results</span>)
            .<span style="color:#a6e22e">map</span>(([<span style="color:#a6e22e">key</span>, <span style="color:#a6e22e">value</span>]) =&gt; <span style="color:#a6e22e">importMonth</span>(<span style="color:#a6e22e">driver</span>, <span style="color:#a6e22e">key</span>, <span style="color:#a6e22e">value</span>))
    )

    <span style="color:#75715e">// Finished, close the driver
</span><span style="color:#75715e"></span>    <span style="color:#a6e22e">driver</span>.<span style="color:#a6e22e">close</span>()

    <span style="color:#a6e22e">console</span>.<span style="color:#a6e22e">log</span>(<span style="color:#e6db74">&#39;Finished!&#39;</span>)
}

<span style="color:#75715e">// Run it!
</span><span style="color:#75715e"></span><span style="color:#a6e22e">run</span>()
</code></pre></div><p>Now to step a bit futher into the code that this fuction calls.</p>
<h3 id="readfromcsvfile"><code>readFromCsv(file)</code></h3>
<p>Say we&rsquo;ve got a CSV with this structure:</p>
<table>
<thead>
<tr>
<th>year</th>
<th>month</th>
<th>day</th>
<th>flight</th>
<th>origin</th>
<th>dest</th>
</tr>
</thead>
<tbody>
<tr>
<td>2013</td>
<td>1</td>
<td>1</td>
<td>517</td>
<td>EWR</td>
<td>IAH</td>
</tr>
</tbody>
</table>
<p>The <code>loadFromCsv</code> function will take this file, separate the rows into data for each shard using the month column.  Because we have a requirement for a 48 hour overlap in data, the condition for a row being added to batch is either the month existing as a key in the <code>results</code> object OR the previous month existing and the day being 1 or 2.</p>
<div class="highlight"><pre style="color:#f8f8f2;background-color:#272822;-moz-tab-size:4;-o-tab-size:4;tab-size:4"><code class="language-js" data-lang="js"><span style="color:#66d9ef">const</span> <span style="color:#a6e22e">readFromCsv</span> <span style="color:#f92672">=</span> <span style="color:#a6e22e">file</span> =&gt; {
    <span style="color:#66d9ef">const</span> <span style="color:#a6e22e">results</span> <span style="color:#f92672">=</span> { <span style="color:#e6db74">&#39;1&#39;</span><span style="color:#f92672">:</span> [], <span style="color:#e6db74">&#39;2&#39;</span><span style="color:#f92672">:</span> [], <span style="color:#e6db74">&#39;3&#39;</span><span style="color:#f92672">:</span> [], };

    <span style="color:#66d9ef">return</span> <span style="color:#66d9ef">new</span> Promise((<span style="color:#a6e22e">resolve</span>, <span style="color:#a6e22e">reject</span>) =&gt; {
        <span style="color:#a6e22e">fs</span>.<span style="color:#a6e22e">createReadStream</span>(<span style="color:#a6e22e">file</span>)
            .<span style="color:#a6e22e">pipe</span>(<span style="color:#a6e22e">csv</span>())
            .<span style="color:#a6e22e">on</span>(<span style="color:#e6db74">&#39;data&#39;</span>, <span style="color:#a6e22e">async</span> <span style="color:#a6e22e">row</span> =&gt; {
                <span style="color:#75715e">// Add to current month
</span><span style="color:#75715e"></span>                <span style="color:#66d9ef">if</span> ( <span style="color:#a6e22e">results</span>[ <span style="color:#a6e22e">row</span>.<span style="color:#a6e22e">month</span> ] ) {
                    <span style="color:#a6e22e">results</span>[ <span style="color:#a6e22e">row</span>.<span style="color:#a6e22e">month</span> ].<span style="color:#a6e22e">push</span>(<span style="color:#a6e22e">row</span>)
                }

                <span style="color:#75715e">// Allow for 48 hours of the next month to be added to the previous month
</span><span style="color:#75715e"></span>                <span style="color:#66d9ef">const</span> <span style="color:#a6e22e">nextMonth</span> <span style="color:#f92672">=</span> ( parseInt(<span style="color:#a6e22e">row</span>.<span style="color:#a6e22e">month</span>) <span style="color:#f92672">+</span> <span style="color:#ae81ff">1</span> ).<span style="color:#a6e22e">toString</span>();
                <span style="color:#66d9ef">if</span> ( <span style="color:#a6e22e">results</span>[ <span style="color:#a6e22e">nextMonth</span> ] <span style="color:#f92672">&amp;&amp;</span> parseInt(<span style="color:#a6e22e">row</span>.<span style="color:#a6e22e">day</span>) <span style="color:#f92672">&lt;=</span> <span style="color:#ae81ff">2</span> ) {
                    <span style="color:#a6e22e">results</span>[ <span style="color:#a6e22e">nextMonth</span> ].<span style="color:#a6e22e">push</span>(<span style="color:#a6e22e">row</span>)
                }
            })
            .<span style="color:#a6e22e">on</span>(<span style="color:#e6db74">&#39;end&#39;</span>, () =&gt; <span style="color:#a6e22e">resolve</span>(<span style="color:#a6e22e">results</span>))
    })
}
</code></pre></div><p>Once this code has separated the data by month, the data then needs to be imported into the relevant shard.</p>
<h3 id="importmonthdriver-key-value"><code>importMonth(driver, key, value)</code></h3>
<p>Making this function <code>async</code> means that can splice the top <code>x</code> number rows from the row, send that through to neo4j in a batch and <code>await</code> the results, then repeat until there are no more items left in the array.</p>
<div class="highlight"><pre style="color:#f8f8f2;background-color:#272822;-moz-tab-size:4;-o-tab-size:4;tab-size:4"><code class="language-js" data-lang="js"><span style="color:#66d9ef">const</span> <span style="color:#a6e22e">importMonth</span> <span style="color:#f92672">=</span> <span style="color:#a6e22e">async</span> (<span style="color:#a6e22e">driver</span>, <span style="color:#a6e22e">key</span>, <span style="color:#a6e22e">data</span>) =&gt; {
    <span style="color:#66d9ef">const</span> <span style="color:#a6e22e">session</span> <span style="color:#f92672">=</span> <span style="color:#a6e22e">driver</span>.<span style="color:#a6e22e">session</span>({ <span style="color:#a6e22e">database</span><span style="color:#f92672">:</span> <span style="color:#e6db74">&#34;fabric&#34;</span> })

    <span style="color:#66d9ef">const</span> <span style="color:#a6e22e">shard</span> <span style="color:#f92672">=</span> <span style="color:#a6e22e">shards</span>[ <span style="color:#a6e22e">key</span> ]
    <span style="color:#66d9ef">const</span> <span style="color:#a6e22e">query</span> <span style="color:#f92672">=</span> <span style="color:#e6db74">`
</span><span style="color:#e6db74">        USE fabric.</span><span style="color:#e6db74">${</span><span style="color:#a6e22e">shard</span><span style="color:#e6db74">}</span><span style="color:#e6db74">
</span><span style="color:#e6db74">        UNWIND $batch AS row
</span><span style="color:#e6db74">        
</span><span style="color:#e6db74">        MERGE (origin:Airport {code: row.origin})
</span><span style="color:#e6db74">        MERGE (destination:Airport {code: row.dest})
</span><span style="color:#e6db74">        
</span><span style="color:#e6db74">        MERGE (f:Flight {id: row.year +&#39;-&#39;+ row.month +&#39;-&#39;+ row.day +&#39;--&#39;+ row.flight})
</span><span style="color:#e6db74">        
</span><span style="color:#e6db74">        MERGE (f)-[:ORIGIN]-&gt;(origin)
</span><span style="color:#e6db74">        MERGE (f)-[:DESTINATION]-&gt;(destination)
</span><span style="color:#e6db74">    `</span>

    <span style="color:#a6e22e">console</span>.<span style="color:#a6e22e">log</span>(<span style="color:#e6db74">`Importing </span><span style="color:#e6db74">${</span><span style="color:#a6e22e">data</span>.<span style="color:#a6e22e">length</span><span style="color:#e6db74">}</span><span style="color:#e6db74"> rows to </span><span style="color:#e6db74">${</span><span style="color:#a6e22e">shard</span><span style="color:#e6db74">}</span><span style="color:#e6db74">`</span>)
    <span style="color:#a6e22e">console</span>.<span style="color:#a6e22e">log</span>(<span style="color:#a6e22e">query</span>)

    <span style="color:#75715e">// While there are still rows left, splice the next X number of rows
</span><span style="color:#75715e"></span>    <span style="color:#75715e">// and run an autocommit transaction
</span><span style="color:#75715e"></span>    <span style="color:#66d9ef">while</span> ( <span style="color:#a6e22e">data</span>.<span style="color:#a6e22e">length</span> ) {
        <span style="color:#66d9ef">const</span> <span style="color:#a6e22e">batch</span> <span style="color:#f92672">=</span> <span style="color:#a6e22e">data</span>.<span style="color:#a6e22e">splice</span>(<span style="color:#ae81ff">0</span>, <span style="color:#a6e22e">batch_size</span>)

        <span style="color:#a6e22e">await</span> <span style="color:#a6e22e">session</span>.<span style="color:#a6e22e">run</span>(<span style="color:#a6e22e">query</span>, { <span style="color:#a6e22e">batch</span> })
    }
}
</code></pre></div><p>The cypher query uses the <code>USE {fabricdb}.{name}</code> syntax explained above to select the relevant data before sending batches.</p>
<p>Of course, the code for a real-world application would be more complex than this - you could be consuming data from a message queue or even using an ETL too.  The basic concept will be the same though; separate the data by shard, then send to the neo4j proxy server in batches.</p>
<h2 id="testing-the-import-process">Testing the Import Process</h2>
<p>If I run the script from the command line, I should see the progress of the import before the <code>Finished!</code> message at the end.</p>
<div class="highlight"><pre style="color:#f8f8f2;background-color:#272822;-moz-tab-size:4;-o-tab-size:4;tab-size:4"><code class="language-sh" data-lang="sh">$ node etl/index.js
Importing <span style="color:#ae81ff">27983</span> rows to january2020
Importing <span style="color:#ae81ff">25309</span> rows to february2020
Importing <span style="color:#ae81ff">29841</span> rows to march2020
Finished!
</code></pre></div><p>I can verity that that the batches have been successfully added to the shards by using the <code>graphIds()</code> function get the ID&rsquo;s of all graphs configured on the proxy, and using the <code>USE fabric.graph({{id})</code> syntax to get a count of the <code>:Flight</code> nodes on each shard.</p>
<pre><code class="language-cypher" data-lang="cypher">WITH ['january2020', 'february2020', 'march2020', 'airports'] AS shards
UNWIND fabric.graphIds() AS id
CALL {
  USE fabric.graph(id)
  MATCH (n:Flight) RETURN count(*) AS count
}
RETURN id, shards[id] AS name, count
ORDER BY id ASC
</code></pre><p>Which returns the following results:</p>
<pre><code>╒════╤══════════════╤════════╕
│&quot;id&quot;│&quot;name&quot;        │&quot;count&quot; │
╞════╪══════════════╪════════╡
│0   │&quot;january2020&quot; | 27983  │
│1   │&quot;february2020&quot;│ 25309  │
│2   │&quot;march2020&quot;   | 29841  │
│3   │&quot;airports&quot;    │ 0      │
└────┴──────────────┴────────┘
</code></pre><h2 id="the-use-graph-clause-is-not-available-what">The <code>USE GRAPH</code> clause is not available?? What</h2>
<p>On more than one occasion I ended up with the following error:</p>
<pre><code>Neo4jError: The `USE GRAPH` clause is not available in this implementation of Cypher due to lack of support for USE graph selector. (line 2, column 5 (offset: 21))
                USE skyshard.january2020&quot;
                    ^
</code></pre><p>This error occurs when you run the query on a database that isn&rsquo;t configured to be the fabric database in <code>fabric.database.name</code>.  If you&rsquo;re running the query in Neo4j Browser or cypher-shell, you can run the <code>:use {database}</code> command.  Or if it&rsquo;s in the driver, you can specify the database when you create a new session.</p>
<div class="highlight"><pre style="color:#f8f8f2;background-color:#272822;-moz-tab-size:4;-o-tab-size:4;tab-size:4"><code class="language-js" data-lang="js"><span style="color:#66d9ef">const</span> <span style="color:#a6e22e">session</span> <span style="color:#f92672">=</span> <span style="color:#a6e22e">driver</span>.<span style="color:#a6e22e">session</span>({ <span style="color:#a6e22e">database</span><span style="color:#f92672">:</span> <span style="color:#e6db74">&#34;fabric&#34;</span> })
</code></pre></div><h2 id="configuring-fabric-with-a-cluster">Configuring Fabric with a Cluster</h2>
<p>Configuring Fabric to work with a sharded cluster is similar to a single instance, the only change is that the initial discovery members are listed in a comma separated list under <code>fabric.graph.{id}.uri</code> in config.  For example, let&rsquo;s say that the march needs some more redundancy due to a large event or the start of holiday season, <a href="https://neo4j.com/docs/operations-manual/current/clustering/">you could configure a three core cluster</a>.  For argument sake, let&rsquo;s say they have the hostnames <code>march-core-1</code>, <code>march-core-2</code> and <code>march-core-3</code>.</p>
<p>The <code>uri</code> config for the proxy server would look something like this:</p>
<pre><code class="language-conf" data-lang="conf">fabric.graph.2.name=march2020
fabric.graph.2.uri=neo4j://march-core-1:7687,neo4j://march-core-2:7687,neo4j://march-core-3:7687
</code></pre><p>Querying the graph by name or id would be the same, except now the proxy server would take care of the routing of the queries between the leader and followers.</p>
<h2 id="next-steps">Next Steps</h2>
<p>This is only a simple example to explain the process but in reality a production query could span many shards for all of the information it needs.  I touched on the idea of Airport data being held in a different shard.  It makes sense to keep static data in it&rsquo;s own shard rather than duplicating it across all shards.  In this case the Airport code is a unique identifier and will never change and is safe to be shared across shards but it may be a hassle to update multiple nodes if, for example, a new restaurant or amenity is added to the airport.</p>
<p>Time should also be taken to consider the performance of a query when running across shards - a query with two separate <code>USE {}</code> calls will cause the second statement to be run once per result streamed from the first statement.  This is the way that Cypher statements work at the moment, but keep in mind that you could be  passing a lot of information across the wire and causing more db hits than you need.  But then again, this is all part of the fun of running a graph database.</p>
<p><a href="https://github.com/adam-cowley/skyshard">The example code is up on github</a> along with docker-compose.yml for anyone wanting to test this out locally.</p>
<p>How has your Fabric setup gone?   Let us know on the below or on the <a href="https://community.neo4j.com/">Neo4j Community forum</a>.</p>


				

				



    
    <ul class="tags">
        
        <li>
            <a href="http://www.adamcowley.co.uk/tags/neo4j/">neo4j</a>
        </li>
        <li>
            <a href="http://www.adamcowley.co.uk/tags/sharding/">sharding</a>
        </li>
        <li>
            <a href="http://www.adamcowley.co.uk/tags/4.0/">4.0</a>
        </li></ul>



			</article>
		</section>
	</div>

	
			</section>
		</main>

		<footer class="footer" role="contentinfo">


			<div class="container">
				<p class="copyright">
					Copyright &copy; 2021 Adam Cowley.
				</p>
				<div class="social">
					<div class="container">
						<ul>
							<li>
        <a href="http://twitter.com/adamcowley" target="_blank">
            <svg style="height:24px;width:24px" version="1.1" id="Icons" xmlns="http://www.w3.org/2000/svg" xmlns:xlink="http://www.w3.org/1999/xlink" x="0px" y="0px" width="100px" height="100px" viewBox="0 0 100 100" xml:space="preserve"> <path id="Twitter__x28_alt_x29_" d="M84.803,46.564c5.055-0.417,8.483-2.715,9.803-5.833c-1.824,1.12-7.484,2.341-10.61,1.178 	c-0.153-0.734-0.324-1.432-0.492-2.062c-2.382-8.746-10.537-15.792-19.082-14.941c0.691-0.279,1.392-0.539,2.092-0.772 	c0.94-0.337,6.459-1.235,5.59-3.183c-0.733-1.713-7.475,1.295-8.744,1.688c1.675-0.63,4.447-1.714,4.743-3.64 	c-2.567,0.352-5.087,1.566-7.034,3.331c0.703-0.757,1.236-1.679,1.349-2.672C55.57,24.033,51.57,32.853,48.333,41.408 	c-2.542-2.463-4.795-4.403-6.816-5.48c-5.67-3.041-12.449-6.213-23.091-10.164c-0.327,3.521,1.741,8.203,7.7,11.316 	c-1.291-0.173-3.652,0.213-5.54,0.665c0.769,4.034,3.28,7.357,10.079,8.964c-3.107,0.205-4.713,0.912-6.168,2.436 	c1.415,2.805,4.868,6.107,11.08,5.429c-6.906,2.977-2.816,8.49,2.804,7.667C28.794,72.143,13.679,71.416,5,63.134 	c22.661,30.879,71.921,18.262,79.262-11.481c5.499,0.047,8.733-1.905,10.738-4.057C91.831,48.134,87.239,47.578,84.803,46.564z"></path> </svg>
        </a>
    </li>
    <li>
        <a href="https://www.linkedin.com/in/adamcowley/" target="_blank">
            <svg version="1.1" id="Icons" xmlns="http://www.w3.org/2000/svg" xmlns:xlink="http://www.w3.org/1999/xlink" x="0px" y="0px"
width="100px" height="100px" viewBox="0 0 100 100" xml:space="preserve" style="enable-background:new 0 0 100 100; width: 18px;height: 26px;">
<path id="LinkedIn__x28_alt_x29_" d="M87.877,5.608H11.174c-3.673,0-6.65,2.886-6.65,6.448v77.101c0,3.562,2.978,6.451,6.65,6.451
h76.703c3.673,0,6.646-2.89,6.646-6.451V12.056C94.523,8.495,91.55,5.608,87.877,5.608z M31.809,80.944H18.211V40.31h13.598V80.944z
M25.011,34.759H24.92c-4.56,0-7.516-3.119-7.516-7.023c0-3.983,3.043-7.017,7.693-7.017c4.651,0,7.512,3.033,7.602,7.017
C32.699,31.641,29.749,34.759,25.011,34.759z M80.827,80.944H67.233v-21.74c0-5.464-1.97-9.191-6.886-9.191
c-3.761,0-5.993,2.515-6.973,4.942c-0.364,0.868-0.453,2.08-0.453,3.292v22.696H39.329c0,0,0.178-36.823,0-40.634h13.593v5.761
c1.805-2.768,5.029-6.717,12.249-6.717c8.947,0,15.656,5.804,15.656,18.291V80.944z M52.834,46.199
c0.024-0.038,0.056-0.084,0.088-0.128v0.128H52.834z" />
</svg>
        </a>
    </li>
    <li>
        <a href="https://github.com/adam-cowley" target="_blank">
            <svg width="20px" height="25px" viewBox="0 0 256 250" version="1.1" xmlns="http://www.w3.org/2000/svg" xmlns:xlink="http://www.w3.org/1999/xlink" preserveAspectRatio="xMidYMid">
                <g>
                    <path d="M128.00106,0 C57.3172926,0 0,57.3066942 0,128.00106 C0,184.555281 36.6761997,232.535542 87.534937,249.460899 C93.9320223,250.645779 96.280588,246.684165 96.280588,243.303333 C96.280588,240.251045 96.1618878,230.167899 96.106777,219.472176 C60.4967585,227.215235 52.9826207,204.369712 52.9826207,204.369712 C47.1599584,189.574598 38.770408,185.640538 38.770408,185.640538 C27.1568785,177.696113 39.6458206,177.859325 39.6458206,177.859325 C52.4993419,178.762293 59.267365,191.04987 59.267365,191.04987 C70.6837675,210.618423 89.2115753,204.961093 96.5158685,201.690482 C97.6647155,193.417512 100.981959,187.77078 104.642583,184.574357 C76.211799,181.33766 46.324819,170.362144 46.324819,121.315702 C46.324819,107.340889 51.3250588,95.9223682 59.5132437,86.9583937 C58.1842268,83.7344152 53.8029229,70.715562 60.7532354,53.0843636 C60.7532354,53.0843636 71.5019501,49.6441813 95.9626412,66.2049595 C106.172967,63.368876 117.123047,61.9465949 128.00106,61.8978432 C138.879073,61.9465949 149.837632,63.368876 160.067033,66.2049595 C184.49805,49.6441813 195.231926,53.0843636 195.231926,53.0843636 C202.199197,70.715562 197.815773,83.7344152 196.486756,86.9583937 C204.694018,95.9223682 209.660343,107.340889 209.660343,121.315702 C209.660343,170.478725 179.716133,181.303747 151.213281,184.472614 C155.80443,188.444828 159.895342,196.234518 159.895342,208.176593 C159.895342,225.303317 159.746968,239.087361 159.746968,243.303333 C159.746968,246.709601 162.05102,250.70089 168.53925,249.443941 C219.370432,232.499507 256,184.536204 256,128.00106 C256,57.3066942 198.691187,0 128.00106,0 Z M47.9405593,182.340212 C47.6586465,182.976105 46.6581745,183.166873 45.7467277,182.730227 C44.8183235,182.312656 44.2968914,181.445722 44.5978808,180.80771 C44.8734344,180.152739 45.876026,179.97045 46.8023103,180.409216 C47.7328342,180.826786 48.2627451,181.702199 47.9405593,182.340212 Z M54.2367892,187.958254 C53.6263318,188.524199 52.4329723,188.261363 51.6232682,187.366874 C50.7860088,186.474504 50.6291553,185.281144 51.2480912,184.70672 C51.8776254,184.140775 53.0349512,184.405731 53.8743302,185.298101 C54.7115892,186.201069 54.8748019,187.38595 54.2367892,187.958254 Z M58.5562413,195.146347 C57.7719732,195.691096 56.4895886,195.180261 55.6968417,194.042013 C54.9125733,192.903764 54.9125733,191.538713 55.713799,190.991845 C56.5086651,190.444977 57.7719732,190.936735 58.5753181,192.066505 C59.3574669,193.22383 59.3574669,194.58888 58.5562413,195.146347 Z M65.8613592,203.471174 C65.1597571,204.244846 63.6654083,204.03712 62.5716717,202.981538 C61.4524999,201.94927 61.1409122,200.484596 61.8446341,199.710926 C62.5547146,198.935137 64.0575422,199.15346 65.1597571,200.200564 C66.2704506,201.230712 66.6095936,202.705984 65.8613592,203.471174 Z M75.3025151,206.281542 C74.9930474,207.284134 73.553809,207.739857 72.1039724,207.313809 C70.6562556,206.875043 69.7087748,205.700761 70.0012857,204.687571 C70.302275,203.678621 71.7478721,203.20382 73.2083069,203.659543 C74.6539041,204.09619 75.6035048,205.261994 75.3025151,206.281542 Z M86.046947,207.473627 C86.0829806,208.529209 84.8535871,209.404622 83.3316829,209.4237 C81.8013,209.457614 80.563428,208.603398 80.5464708,207.564772 C80.5464708,206.498591 81.7483088,205.631657 83.2786917,205.606221 C84.8005962,205.576546 86.046947,206.424403 86.046947,207.473627 Z M96.6021471,207.069023 C96.7844366,208.099171 95.7267341,209.156872 94.215428,209.438785 C92.7295577,209.710099 91.3539086,209.074206 91.1652603,208.052538 C90.9808515,206.996955 92.0576306,205.939253 93.5413813,205.66582 C95.054807,205.402984 96.4092596,206.021919 96.6021471,207.069023 Z" fill="#0B4F71"></path>
                </g>
            </svg>        </a>
    </li>
						</ul>
					</div>
				</div>
			</div>
		</footer>
	</div>


<script async src="https://www.googletagmanager.com/gtag/js?id=UA-3764211-9"></script>
<script>
  window.dataLayer = window.dataLayer || [];
  function gtag(){dataLayer.push(arguments);}
  gtag('js', new Date());

  gtag('config', 'UA-3764211-9');
</script>



<script src="/js/parts/scripts.js"></script>

</body>
</html>
